<template>
  <div class="">
    <div class="on-view" @click="onView">
        <slot></slot>
    </div>
    <Modal v-model="visible" width="800px" class="comDlg">
        <h2 class="title">鲸鱼数据-广告主合作协议</h2>
            <div class="content">
                <p>欢迎申请注册成为鲸鱼数据平台用户，使用鲸鱼数据平台的服务。在完成注册程序或以任何方式使用鲸鱼数据平台服务前，请您仔细阅读并透彻理解以下全部内容。您在注册之前，应当仔细阅读本协议，并同意遵守本协议后方可成为注册用户。一旦您完成“同意条款并注册”或开始以其他方式使用鲸鱼数据平台服务，即表明您已阅读并同意受本协议条款的约束。 如您不同意本协议条款或其中任何条款约定，应不再进行下一步或停止注册程序。您在使用单项服务或产品时，应当接受相关协议后方能使用。</p>

                <p>您是合法注册、依法经营的主体，希望通过鲸鱼数据平台服务展示您的广告，向用户宣传、推广其合法生产、销售或代理的产品、服务等。为使用鲸鱼数据平台相关服务，您应当阅读并遵守本协议。</p>



                <h4> 一、定义</h4>

                <p>除非另有明确约定，否则，下列词语在本协议中具有如下含义:</p>

                <p>1.1 鲸鱼数据平台：指由北京智能广宣有限公司自主研发并运营的人工智能大数据营销平台，可提供映前广告投放、KOL营销、影片异业合作、效果报告等广告服务。广告主可以按照鲸鱼数据平台规则，将其广告展示在平台合作的不同媒体资源中。</p>

                <p>1.2 广告主：是指通过鲸鱼广告服务平台向用户宣传、推广产品、服务的主体。</p>

                <p>1.3 广告：指广告主自行设计制作或依法委托他人设计制作的，用于宣传其品牌或其生产或销售的商品、服务的信息内容，包括但不限于图片、文字、视频、flash等。</p>

                <p>1.4 广告费：指使用鲸鱼广告服务所产生的费用，广告费的结算方式包括但不限于按场次计费，CPM(千次广告展示计费)等，具体以鲸鱼数据平台规则为准。</p>

                <p>1.5 鲸鱼数据平台规则：指广告主使用鲸鱼数据平台时需要遵守的相关规则，包括但不限于行业准入规则、广告审核规范、违规处罚规范、广告计费及结算、广告代理及返点规则及将来可能发布的与鲸鱼广告服务相关的协议、规则、规范等。相关内容可能以平台公告、书面文件、通知、FAQ等多种形式体现，广告主应当予以遵守。</p>

                <p>1.6 法律法规：指中华人民共和国（包括港澳台地区）、广告主所在地及广告实际投放或展示的国家、地区的相关法律、法规、部门规章及行业规范等。</p>



                <h4>二、服务规则</h4>

                <p>2.1 广告主应依照鲸鱼数据平台规则提供真实、合法、有效的相关证明文件（文件均需加盖当事人的公章或签字），包括但不限于：</p>

                <p>（1）营业执照等身份证明以及行业许可证等资质证明、其他生产的证明文件等。</p>

                <p>（2）广告代理授权、 品牌授权书、APP推广授权等授权文件；</p>

                <p>（3）广告主完整、合法、有效的联系方式，如邮箱、电话、地址等。</p>

                <p>（4）其他必要证明文件，包括但不限于产品质量检验证明、 广告审查表等。</p>

                <p>若上述证明文件发生变更的，广告主应当在变更之日起3个工作日内书面通知鲸鱼数据平台或依照鲸鱼数据平台规则进行修改。</p>

                <p>2.2 广告主所推广的商品、服务等任何内容均符合国家法律法规、政策的相关规定和《鲸鱼数据平台广告主合作协议》《广告素材审核规范》等鲸鱼服务协议和广告业务规则制度的要求。并且，广告主理解并同意，鲸鱼数据平台有权根据法律法规政策要求或自身运营安排，随时单方对广告业务规则制度进行调整，广告主应当予以遵守。</p>



                <h4>三、广告主权利义务</h4>

                <p>3.1 广告主保证其是依据法律法规规定设立、经营的主体，已经取得必要经营资质，有权利和能力签订和履行本协议，广告主提交的一切资料（包括但不限于注册信息、身份资质、经营资质、授权文件等）真实、合法、有效，保证使用来源合法的资金支付广告费用。</p>

                <p>3.2 广告主所推广的商品、服务等任何内容均符合国家法律法规、政策的相关规定和《鲸鱼数据平台广告主合作协议》《广告素材审核规范》等鲸鱼服务协议和广告业务规则制度的要求。并且，广告主理解并同意，鲸鱼数据平台有权根据法律法规政策要求或自身运营安排，随时单方对广告业务规则制度进行调整，广告主应当予以遵守。</p>

                <p>3.3 广告主广告应当真实、合法、有效，不侵犯他人合法权益且符合鲸鱼数据平台规则的要求，包括但不限于：</p>

                <p>（1）不得含有虚假内容，不得欺骗和误导消费者；</p>

                <p>（2）对商品的品牌、性能、质量、价格或服务的内容、价格、允诺等应当清楚、明白且与实际相符；</p>

                <p>（3）广告中使用第三方名义、形象、标识或作品等的，已经事先取得第三方的同意；</p>

                <p>（4）广告中含有赠送礼品等承诺的，保证承诺内容与实际情况一致，不得含有虚假的奖励、有奖销售、赠送等内容。</p>

                <p>3.4 广告主应当依法合理使用鲸鱼数据平台，不得实施任何危害鲸鱼数据平台安全或损害平台权益的行为，包括但不限于：</p>

                <p>（1）进行任何改变或试图改变鲸鱼数据平台服务系统配置或破坏系统安全的行为。</p>

                <p>（2）任何破坏或试图破坏网络安全的行为，包括但不限于以病毒、木马、恶意代码、钓鱼等方式，采取对平台、服务器进行恶意扫描、非法侵入系统、非法获取数据等。</p>

                <p>（3）利用技术或其他手段破坏、扰乱鲸鱼数据平台的运营或妨碍他人对鲸鱼数据平台的使用，或者制作、传播实施前述目的的方法等。</p>

                <p>（4）仿冒或使用仿冒的鲸鱼数据平台产品（包括但不限于仿冒鲸鱼数据平台广告形式），使用户发生误解或混淆。</p>

                <p>（5）危害鲸鱼数据平台安全或损害平台权益的其他行为。</p>

                <p> 3.5因广告、推广对象等产生任何纠纷和争议的，应由广告主自行独立解决并承担全部责任，包括但不限于由广告主以自己名义出面，与第三方协商、应诉或接受主管机关的审查等，并承担所有费用、赔偿损失等。</p>

                <p>如因广告主违反本协议或鲸鱼数据平台规则给鲸鱼数据平台、流量主或其他任何主体造成损失的（包括但不限于因处理用户投诉、用户索赔、权利人索赔、行政处罚等支付的费用，以及被没收的广告费等），广告主应予以赔偿并配合处理，广告主不得以广告是由其委托的第三方投放等任何理由拒绝承担本协议约定的义务。</p>



                <h4>四、鲸鱼数据平台权利义务</h4>

                <p>4.1 鲸鱼数据平台提供与鲸鱼数据平台广告服务有关的技术支持或资料说明,并负责鲸鱼数据平台系统的运营、维护。为了完善鲸鱼数据平台广告服务，鲸鱼数据平台及其关联公司、鲸鱼数据平台合作伙伴有权不断调整鲸鱼数据平台及其具体服务，鲸鱼数据平台及其具体服务名称、功能、域名的调整，不影响本协议的效力。</p>

                <p>鲸鱼数据平台有权根据单方运营安排随时调整或终止部分或全部的服务，包括但不限于停止特定服务、对某项服务进行升级、调整某项服务的功能或整合某些服务等。广告主有权根据自身需求决定是否继续使用相关服务。</p>

                <p>4.2 鲸鱼数据平台有权对广告主的证明文件及广告进行审核并根据鲸鱼数据平台规则决定是否允许投放广告，该审核仅为形式审核，鲸鱼数据平台不对上述证明文件、广告予以任何保证和承诺，也不代表鲸鱼数据平台有义务对广告的真实性、合法性进行任何确认或担保，并且，并不因为鲸鱼数据平台的审核，而减轻广告主经营资质、广告等的真实性、合法性的保证责任，由此产生的一切责任和后果仍由广告主单独承担。</p>

                <p>4.3 为依法合理保护各方的利益，鲸鱼数据平台有权制定专门的侵权投诉处理流程，广告主应当予以遵守。如广告主受到主管部门调查或被第三方投诉，或广告主投诉第三方，鲸鱼数据平台有权根据自行判断将争议中相关方的主体资料、联系方式、投诉相关内容等必要信息（包括但不限于名称、电话、证照等）提供给主管部门或相关方，以便及时解决投诉纠纷，保护各方合法权益，广告主应当予以配合。</p>

                <p>若广告主受到主管部门调查或第三方投诉，广告主应在3个自然日内妥善处理，否则，鲸鱼数据平台有权在按照本协议约定采取相应措施的同时，为维护投诉方合法权益，自主决定先行垫付费用用于处理纠纷及赔偿损失，鲸鱼数据平台有权在广告主鲸鱼数据平台账户内直接扣除相应费用，或另行向广告主追偿。</p>

                <p>4.4 如广告受到主管机关调查或被第三方（包括但不限于用户、权利人等，下同）投诉，或者有明确证据证明广告主的资质缺失或存在严重瑕疵， 或者广告主存在违反法律法规的情形，鲸鱼数据平台有权根据一般人的认识自行独立判断，以认定广告主是否存在违法违规的情况。若鲸鱼数据平台经过判断认为广告主存在违法违规，或违反本协议约定的情况（包括但不限于逾期付款等）的，鲸鱼数据平台有权随时单方对广告主采取以下一项或多项措施：</p>

                <p>（1）停止涉嫌违规广告的投放，无论该广告是否已经上线。</p>

                <p>（2）要求广告主对广告进行修改直至符合相关规定或更正违约行为。</p>

                <p>（3）对广告主提交的全部广告予以下线，永久或暂时封停广告主账户。</p>

                <p>（4）限制广告主使用鲸鱼数据广告服务，暂停广告主提交的全部内容的审核工作。</p>

                <p>（5）对广告主罚款、扣除保证金，或扣除广告主鲸鱼数据平台账户剩余款项，或要求广告主在指定期限内支付等额现金。相关费用可用于赔偿用户损失和支付合理费用等，包括但不限于赔偿鲸鱼数据平台、流量主或其他任何主体等因广告主行为导致的损失（如行政罚款、权利人索赔、用户赔偿，以及被没收的广告费等）。</p>

                <p>（6）扣除广告主鲸鱼数据平台账户全部剩余款项作为违约金，不予退还（剩余款项不足以赔偿鲸鱼数据平台损失的，广告主应予补足）。</p>

                <p>（7）封停账户，终止本协议，要求广告主承担违约责任等，同时，可以禁止广告主再次使用鲸鱼数据平台服务。</p>

                <p>（8）其他依据鲸鱼数据平台规则采取的措施。</p>

                <p>鲸鱼数据平台依据本协议约定对广告主采取措施所引起的纠纷、责任等一概由广告主自行负责，若因此给广告主或其他主体造成损失（包括但不限于相关数据清空、投放计划未能完成、剩余预付款作为违约金而归鲸鱼数据平台所有等）的，广告主应自行承担；造成鲸鱼数据平台或他人损失的，广告主应独立承担赔偿责任。</p>

                <p>4.5 为向广告主提供更优质服务，以及不断提高鲸鱼数据平台广告服务水平，鲸鱼数据平台有权对广告主使用鲸鱼数据平台广告服务过程中产生的信息（包括但不限于曝光人次等）进行整理、分析，并将前述整理、分析结果用于鲸鱼数据平台广告服务，包括但不限于以供后续向广告主提供持续的、更优质的服务、依据信息进行行业分析和用户调研或向相关用户提供更加合适的广告等。</p>

                <p>4.6 为保护广告主鲸鱼数据平台账户的安全，鲸鱼数据平台有权对超过一定期限未有操作的账户进行暂时冻结，如果广告主需要重新启用被暂时冻结的账户，广告主需要再次根据鲸鱼数据平台规则激活该账户。</p>

                <p>4.7 鲸鱼数据平台有权根据业务经营需求，将本协议中的全部或部分权利与义务转让给鲸鱼数据平台的关联公司，但须提前30个工作日通知广告主。</p>

                <p>4.8 鲸鱼数据平台有权以短信、电子邮件、系统公告、站内消息等方式中的一种或多种，向广告主发送与鲸鱼大数据广告服务有关的信息，包括但不限于营销活动、折扣优惠、新增服务类型、广告等。</p>

                <p>4.9 鲸鱼数据平台因本协议项下合作所承担的赔偿责任总额不超过违约服务对应的当次广告费的总额，并且，对于与本协议项下合作有关或由其引起的任何损失，均不承担任何赔偿责任。</p>



                <h4>五、费用结算</h4>

                <p>5.1 广告费</p>

                <p>（1）广告费以人民币计算。鲸鱼大数据广告服务采用预付费方式，双方另有约定除外。广告主需保持鲸鱼数据平台账户内余额充足并及时续费，或提前支付广告执行单约定的广告费，否则，会影响广告的投放。</p>

                <p>（2）广告的投放范围、曝光次数等数据，以及服务商与子客的绑定时间、解绑时间、绑定期间的消耗数据等与使用鲸鱼大数据广告服务有关的任何数据均以鲸鱼数据平台后台统计数据为准。</p>

                <p>（3）涉及投放场次、CPM（千人次曝光）类型的广告投放，其效果数据结果以鲸鱼数据平台的效果数据为准。</p>

                <p> 5.2 发票</p>

                <p>（1）鲸鱼数据平台在广告主投放广告后，根据广告主的申请为广告主开具发票；发票面额为广告主实际投放的广告费用总额。</p>

                <p>（2）发票不可重复开具，因广告主递交材料错误造成的发票抬头、邮寄地址等信息错误，由广告主自行承担全部后果。</p>

                <p>（3）广告主申请被审核通过后，鲸鱼数据平台将在审核通过后的次月完成发票开具；相关发票一经发送至广告主所填写的通讯地址，即视为鲸鱼数据平台已经完成了发票开具义务。</p>

                <p>（4）鲸鱼数据平台仅向广告主开具发票，鲸鱼数据平台不向任何其他第三方开具发票。</p>

                <p>5.3 退款</p>

                <p>若广告主鲸鱼数据平台账户内有现金剩余款项的，广告主可申请对鲸鱼数据平台账户内现金部分剩余款项进行退款，但需同时满足下列条件：</p>

                <p>（1）广告主已填写相关申请文件。</p>

                <p>（2）广告主没有任何未处理完毕的事宜，包括但不限于正在执行的广告订单、违规处罚、违约赔偿或投诉纠纷等。</p>

                <p>（3）鲸鱼数据平台收到广告主提交的申请文件并经核实后，将在收到申请文件的15工作日内安排退款事宜。</p>




                <h4>六、用户隐私制度</h4>

                <p>尊重用户隐私是鲸鱼数据平台的一项基本政策。鲸鱼数据平台运营方将严格遵守法律规定收集、存储、使用、披露和保护用户的个人信息。</p>

               <p> 鲸鱼数据平台运营方将采取合理的措施来保护用户的个人信息，以防止信息的丢失，滥用、未经授权的访问、泄露、被更改或销毁。鲸鱼数据平台运营方承诺不向第三方披露或提供用户的个人信息，除非在以下情况：</p>

                <p>（1）已获得用户的同意和授权;</p>

                <p>（2）符合有关规则和规定；</p>

                <p>（3）与公众利益保持一致;</p>

                <p>（4）鲸鱼数据平台的合法权益需受保护。</p>

                <p>（5）通过收集来的信息，能更好地了解产品和服务，并了解用户喜好。在充分保护用户的隐私数据的前提下，鲸鱼数据平台有权分析和处理用户数据库。</p>



                <h4>七、服务的中断与终止</h4>

                <p>1. 鲸鱼数据平台运营方始终在不断变更和改进服务。鲸鱼数据平台可能会增加或删除功能，也可能暂停或彻底停止某项服务。用户同意鲸鱼数据平台有权行使上述权利且不需对用户或第三方承担任何责任。</p>

                <p>2. 用户向本平台提出注销用户身份的，本平台经审核同意后注销，本协议自注销之时起即终止，但本平台仍保留下列权利：</p>

                <p>(1) 有权保留被注销用户的资料，包括但不限于用户注册信息、交易记录等；</p>

                <p>(2) 如用户在注销前在本平台存在违法或违反本协议的行为，本平台仍可行使本协议所规定的权利。</p>

                <p>3. 用户如存在下列情况，本平台可通过注销用户账户的方式终止服务：</p>

                <p>(1) 本公司及本平台根据所掌握的情况，认定用户存在违法、违反本协议相关规定或其它不当行为的；</p>

                <p>(2) 用户注册信息及提供的资料有虚假内容的；</p>

                <p>(3) 出现本协议第三条第12款行为的；</p>

                <p>(4) 本公司及本平台认为需终止服务的其它情况。</p>



                <h4>八、不可抗力及免责</h4>

                <p>1. 因受不可抗力影响而不能履行或不能完全履行本协议的一方无需承担违约责任。</p>

                <p> 但是，遇有不可抗力事件的一方，应立即将事件情况书面通知对方，并应于5个工作日内出示有效证明。双方按照事件对协议的履行的影响程度，再行协商决定是否继续履行本协议或终止协议。</p>

                <p>2. 鉴于互联网之特殊性质，鲸鱼数据平台的免责事由亦包括但不限于下列任何影响鲸鱼数据平台正常运营之情形：</p>

                <p>（1）黑客攻击、计算机病毒侵入或发作。</p>

                <p>（2）计算机系统遭到破坏、瘫痪或无法正常使用导致鲸鱼数据平台未能依约履行协议。</p>

                <p>（3）基础运营商或主管部门故障、调整导致之影响。</p>

                <p>（4）因政府管制而造成的暂时性关闭、服务调整等。</p>

                <p>（5）国家法律法规或者政策的颁布、调整、变更等导致的。</p>

                <p>（6）由于广告主或子客原因（包括但不限于操作失误、系统故障等）导致的。</p>

                <p>（7）其它非鲸鱼数据平台过错造成的原因等。</p>



                <h4>九、法律适用与争议解决</h4>

               <p>1. 本协议之订立、生效、解释、履行、修订与争议解决均适用中华人民共和国法律；</p>

               <p>2. 因本协议所生之相关争议，均应提交北京市海淀区人民法院诉讼解决。</p>



                <h4>十、特别声明</h4>

                <p>1. 提供直供服务的用户同意本公司及本平台可根据市场情况和服务费费率调整、自动更改相应的对外报价。如果需要，用户可以根据需求在此基础上再次自行进行修改；</p>

                <p>2. 鲸鱼数据平台运营方有权根据业务情况修改本协议条款以及各单项服务的相关条款，在必要时通过在网页上发出公告等合理方式予以公布。用户在享受各项服务时，应当及时查阅了解修改的内容，并自觉遵守本协议条款以及该单项服务的相关条款，用户点击“同意”按钮即表示完全接受协议的所有条款； 用户如继续使用本协议条款涉及的服务，则视为对修改内容的同意，当发生有关争议时，以最新的协议条款为准；用户在不同意修改内容的情况下，鲸鱼数据平台运营方有权停止使用本协议条款涉及的服务。</p>

                
            </div>

            <div class="footer">
               <Button class="footer-btn" @click="visible = false">我已阅读</Button>
            </div>
    </Modal>
  </div>
</template>

<script lang='ts'>
import {Component} from 'vue-property-decorator'
import ViewBase from '@/util/ViewBase'
@Component
export default class Main extends ViewBase {
    visible = false

    onView() {
        this.visible = true
    }
}

</script>
<style lang='less' scoped>
@import '~@/views/account/information/common.less';
@import '~@/views/portal/login/common.less';
.content {
  max-height: 550px;
  overflow: auto;
  font-size: 14px;
  h4 {
    font-weight: normal;
    padding-bottom: 15px;
  }
  p {
    text-indent: 10px;
    padding-bottom: 15px;
  }
}
.on-view {
  font-size: 14px;
  cursor: pointer;
}
.content::-webkit-scrollbar {
  width: 10px;
}
.content::-webkit-scrollbar-track {
  background-color: #fff;
  -webkit-border-radius: 2em;
  -moz-border-radius: 2em;
  border-radius: 2em;
}
.content::-webkit-scrollbar-thumb {
  background-color: #d8d8d8;
  -webkit-border-radius: 2em;
  -moz-border-radius: 2em;
  border-radius: 2em;
}
</style>